Dlubal.RFEM5.LinearDimension
Linear Dimension structure

Dlubal.RFEM5.LinearDimension.No
Number

Dlubal.RFEM5.LinearDimension.ID
Identifier

Dlubal.RFEM5.LinearDimension.Tag
Tag

Dlubal.RFEM5.LinearDimension.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.LinearDimension.NodeList
List of nodes

Dlubal.RFEM5.LinearDimension.Reference
Reference

Dlubal.RFEM5.LinearDimension.CoordinateSystemNo
Coordinate system number

Dlubal.RFEM5.LinearDimension.Plane
Plane

Dlubal.RFEM5.LinearDimension.LocalOffset
Offset is set locally

Dlubal.RFEM5.LinearDimension.Offset
Offset

Dlubal.RFEM5.LinearDimension.Lengths
Array of lengths (read only)

Dlubal.RFEM5.LinearDimension.Symbol
Symbol